wtcat/platform/embeded/rtems/bsps/arm/stm32h750-art-pi/stm32h7_spi_linux.c
	if (force || (spi_dev->mode & SPI_MODE_3) != spi->curr_mode) {
		uint32_t clrb = 0, setb = 0;
		spi->curr_mode = spi_dev->mode;

		/* SPI slave device may need time between data frames */
		spi->cur_midi = 0;
		// if (np && !of_property_read_u32(np, "st,spi-midi-ns", &spi->cur_midi))
		// 	dev_dbg(spi->dev, "%dns inter-data idleness\n", spi->cur_midi);

		if (spi_dev->mode & SPI_CPOL)
			setb |= spi->cfg->regs->cpol.mask;
		else
			clrb |= spi->cfg->regs->cpol.mask;

		if (spi_dev->mode & SPI_CPHA)
			setb |= spi->cfg->regs->cpha.mask;
		else
			clrb |= spi->cfg->regs->cpha.mask;

		if (spi_dev->mode & SPI_LSB_FIRST)
			setb |= spi->cfg->regs->lsb_first.mask;
		else
			clrb |= spi->cfg->regs->lsb_first.mask;

		dev_dbg(spi->dev, "cpol=%d cpha=%d lsb_first=%d cs_high=%d\n",
			spi_dev->mode & SPI_CPOL,
			spi_dev->mode & SPI_CPHA,
			spi_dev->mode & SPI_LSB_FIRST,
			spi_dev->mode & SPI_CS_HIGH);

		spin_lock_irqsave(&spi->lock, flags);

		/* CPOL, CPHA and LSB FIRST bits have common register */
		if (clrb || setb)
			writel_relaxed(
				(readl_relaxed(spi->base + spi->cfg->regs->cpol.reg) &
				~clrb) | setb,
				spi->base + spi->cfg->regs->cpol.reg);

		spin_unlock_irqrestore(&spi->lock, flags);
	}

	return 0;
}

/**
 * stm32h7_spi_dma_cb - dma callback
 * @data: pointer to the spi controller data structure
 *
 * DMA callback is called when the transfer is complete or when an error
 * occurs. If the transfer is complete, EOT flag is raised.
 */
static void stm32h7_spi_dma_cb(struct drvmgr_dev *dev, void *user_data, 
	uint32_t channel, int status) {
	struct stm32_spi *spi = user_data;
	unsigned long flags;
	uint32_t sr;

	(void) channel;
	(void) status;
	(void) user_data;
	(void) dev;
	spin_lock_irqsave(&spi->lock, flags);

	sr = readl_relaxed(spi->base + STM32H7_SPI_SR);

	spin_unlock_irqrestore(&spi->lock, flags);

	if (!(sr & STM32H7_SPI_SR_EOT))
		dev_warn(spi->dev, "DMA error (sr=0x%08x)\n", sr);

	/* Now wait for EOT, or SUSP or OVR in case of error */
}

/**
 * stm32_spi_dma_config - configure dma slave channel depending on current
 *			  transfer bits_per_word.
 * @spi: pointer to the spi controller data structure
 * @dma_conf: pointer to the dma_slave_config structure
 * @dir: direction of the dma transfer
 */
static int stm32h7_spi_dma_configure(struct stm32_spi *spi, bool dma_tx) {
	static int dummy;
	uint32_t maxburst;
    int ret;
	
	if (spi->cfg->has_fifo) {
		/* Valid for DMA Half or Full Fifo threshold */
		if (spi->cur_fthlv == 2)
			maxburst = 1;
		else
			maxburst = spi->cur_fthlv;
	} else {
		maxburst = 1;
	}

    if (dma_tx && spi->dma_tx) {
        struct dma_config *config = &spi->dma_tx->config;
        struct dma_chan *dma_tx = spi->dma_tx;
        struct dma_block_config txblk = {0};

        config->channel_direction = MEMORY_TO_PERIPHERAL;
        config->dest_data_size = spi->cur_bpw >> 3;
        config->dest_burst_length = maxburst;
        config->source_data_size = spi->cur_bpw >> 3;
        config->source_burst_length = maxburst;
        config->channel_priority = 0;
        config->head_block = &txblk;
        config->block_count = 1;
		if (spi->cur_comm == SPI_SIMPLEX_TX ||
		    spi->cur_comm == SPI_3WIRE_TX) {
			config->dma_callback = stm32h7_spi_dma_cb;
			config->user_data = spi;
		}
        txblk.block_size = sizeof(dummy);
        txblk.source_address = (dma_addr_t)&dummy;
        txblk.source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
        txblk.dest_address = (dma_addr_t)&spi->base->TXDR;
        txblk.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
        txblk.fifo_mode_control = 1;
        ret = dma_configure(dma_tx->dev, dma_tx->channel, &dma_tx->config);
        if (ret) {
            pr_err("Configure UART(%s) DMA-TX failed: %d\n", spi->dev->name, ret);
            goto _free_chan;
        }
		dev_dbg(spi->dev, "Tx DMA config buswidth=%d, maxburst=%d\n",
			spi->cur_bpw, maxburst);
    }
    if (!dma_tx && spi->dma_rx) {
        struct dma_config *config = &spi->dma_rx->config;
        struct dma_chan *dma_rx = spi->dma_rx;
        struct dma_block_config rxblk = {0};

        config->channel_direction = PERIPHERAL_TO_MEMORY;
        config->dest_data_size = spi->cur_bpw >> 3;
        config->dest_burst_length = 1;
        config->source_data_size = spi->cur_bpw >> 3;
        config->source_burst_length = 1;
        config->complete_callback_en = 1;
        config->channel_priority = 1;
        config->dma_callback = stm32h7_spi_dma_cb;
        config->user_data = spi;
        config->dma_callback = NULL;
        config->user_data = NULL;
        config->head_block = &rxblk;
        config->block_count = 1;

        rxblk.block_size = sizeof(dummy);
        rxblk.source_address = (dma_addr_t)&spi->base->RXDR;
        rxblk.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
        rxblk.dest_address = (dma_addr_t)&dummy;
        rxblk.dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
        rxblk.fifo_mode_control = 1;
        ret = dma_configure(dma_rx->dev, dma_rx->channel, &dma_rx->config);
        if (ret) {
            pr_err("Configure UART(%s) DMA-RX failed: %d\n", spi->dev->name, ret);
            goto _free_chan;
        }
		dev_dbg(spi->dev, "Rx DMA config buswidth=%d, maxburst=%d\n",
			spi->cur_bpw, maxburst);
    }
    return 0;

_free_chan:
    if (spi->dma_tx) 
        dma_stop(spi->dma_rx->dev, spi->dma_rx->channel);
    if (spi->dma_tx) 
        dma_stop(spi->dma_tx->dev, spi->dma_tx->channel);

    return ret;
}

/**
 * stm32h7_spi_transfer_one_irq - transfer a single spi_transfer using
 *				  interrupts
 * @spi: pointer to the spi controller data structure
 *
 * It must returns 0 if the transfer is finished or 1 if the transfer is still
 * in progress.
 */
static int stm32h7_spi_transfer_one_irq(struct stm32_spi *spi)
{
	unsigned long flags;
	uint32_t ier = 0;

	/* Enable the interrupts relative to the current communication mode */
	if (spi->tx_buf && spi->rx_buf)	/* Full Duplex */
		ier |= STM32H7_SPI_IER_DXPIE;
	else if (spi->tx_buf)		/* Half-Duplex TX dir or Simplex TX */
		ier |= STM32H7_SPI_IER_TXPIE;
	else if (spi->rx_buf)		/* Half-Duplex RX dir or Simplex RX */
		ier |= STM32H7_SPI_IER_RXPIE;

