wtcat/platform/embeded/rtems/bsps/arm/stm32h750-art-pi/stm32h7_spi_linux.c
    spi->thread = rtems_task_self();
    while (n > 0) {
        _Assert(curr_msg->len < UINT16_MAX);
		stm32_spi_prepare_msg(bus, false);
        err = stm32_spi_transfer_one(bus, spi, (void *)curr_msg);
        if (err)
            break;
        curr_msg++;
        n--;
    };
	stm32_spi_unprepare_msg(bus);
    return err;
}

static void stm32_spi_destroy(spi_bus *bus) {
    struct stm32_spi *spi = (struct stm32_spi *)bus;
    rtems_interrupt_level level;

    rtems_interrupt_local_disable(level);
    stm32h7_spi_disable(spi);
    rtems_interrupt_local_enable(level);
    drvmgr_interrupt_unregister(spi->dev, IRQF_HARD(spi->irq), 
        stm32_spi_isr, spi);
    clk_disable(spi->clk, &spi->clkid);
    if (spi->dma_tx)
        dma_chan_release(spi->dma_tx);
    if (spi->dma_rx)
        dma_chan_release(spi->dma_rx);
    spi_bus_destroy(bus);
    free(spi->cs_gpios);
    free(spi);
}

static int stm32_spi_setup(spi_bus *bus) {
	(void) bus;
	return 0;
}

static int stm32_spi_bus_unite(struct drvmgr_drv *drv, struct drvmgr_dev *dev) {
	return ofw_platform_bus_match(drv, dev, DRVMGR_BUS_TYPE_SPI);
}

static struct drvmgr_bus_ops stm32h7_spi_bus = {
	.init = {
		ofw_platform_bus_populate_device,
	},
	.unite = stm32_spi_bus_unite
};

static int stm32_spi_preprobe(struct drvmgr_dev *dev) {
    struct dev_private *devp = device_get_private(dev);
    rtems_ofw_memory_area reg;
    rtems_vector_number irq;
    struct stm32_spi *spi;
    int ret;

    ret = rtems_ofw_get_reg(devp->np, &reg, sizeof(reg));
    if (ret < 0) 
        return -ENOSTR;
    ret = rtems_ofw_get_interrupts(devp->np, &irq, sizeof(irq));
    if (ret < 0) 
        return -ENOSTR;
    spi = rtems_calloc(1, sizeof(struct stm32_spi));
	if (spi == NULL) 
		return -ENOMEM;
	spi->cfg = device_match_data(dev);
    spi->base = (void *)reg.start;
    spi->irq = (int)irq;
    spi->dev = dev;
    devp->devops = &spi->bus;
    dev->priv = spi;
    pr_dbg("%s: %s reg<0x%x> irq<%d>\n", __func__, dev->name, reg.start, irq);
    return ofw_platform_bus_device_register(dev, &stm32h7_spi_bus, 
    DRVMGR_BUS_TYPE_SPI);
}

static int stm32_spi_probe(struct drvmgr_dev *dev) {
    struct dev_private *devp = device_get_private(dev);
    struct stm32_spi *spi = dev->priv;
    uint32_t clksrc = 0;
    int ret = -EINVAL;

    if (stm32h7_spi_get_clksrc(dev->name, &clksrc)) {
        pr_err("%s: Invalid device name (%s)\n", __func__, dev->name);
        return -EINVAL;
    }
    //TODO: Allocate muli-gpios
    spi->cs_gpios = ofw_cs_gpios_request(devp->np, 0, &spi->cs_num);
    if (!spi->cs_gpios) {
        pr_err("%s: reqeust gpio_cs failed!\n", __func__);
        return -ENOSTR;
    }
    _Assert(spi->cs_num < 32);

    spi->clk = ofw_clock_request(devp->np, NULL, (pcell_t *)&spi->clkid, 
        sizeof(spi->clkid));
    if (!spi->clk) {
        pr_err("%s: reqeust clock failed!\n", __func__);
        ret = -ENODEV;
        goto _free_cs;
    }
    ret = drvmgr_interrupt_register(dev, IRQF_HARD(spi->irq), dev->name, 
		stm32_spi_isr, spi);
    if (ret) {
        pr_err("%s register IRQ(%d) failed\n", dev->name, spi->irq);
        goto _free;
    }

	rtems_interrupt_server_request_initialize(0, &spi->req, 
		stm32h7_spi_irq_thread, spi);
	rtems_interrupt_server_request_set_vector(&spi->req, spi->irq);
    spi_bus_init(&spi->bus);
	spi->bus.transfer = stm32_spi_transfer;
    spi->bus.setup = stm32_spi_setup;
    spi->bus.destroy = stm32_spi_destroy;
    spi->bus.lsb_first = false;
    spi->bus.bits_per_word = 8;
    spi->bus.mode = SPI_MODE_0;
    spi->bus.max_speed_hz = LL_RCC_GetSPIClockFreq(clksrc) / 2;
    spi->bus.speed_hz = 8000000;
    spi->bus.cs = UINT8_MAX;
	ret = spi_bus_register(&spi->bus, dev->name);
	if (ret) {
		drvmgr_interrupt_unregister(dev, IRQF_HARD(spi->irq), 
            stm32_spi_isr, spi);
        pr_err("%s: install interrupt failed!\n", __func__);
        goto _free_cs;
    }
    /* Enable clock */
    clk_enable(spi->clk, &spi->clkid);
	stm32_spi_prepare_msg(&spi->bus, false);
    pr_dbg("%s: spi bus max-frequency (%u)\n", __func__, spi->bus.max_speed_hz);
	return 0;

_free_cs:
    free(spi->cs_gpios);
_free:
    free(spi);
    return ret;
}

static int stm32h7_spi_extprobe(struct drvmgr_dev *dev) {
    struct dev_private *devp = device_get_private(dev);
    struct stm32_spi *spi = dev->priv;
    pcell_t specs[3];
  
    if (pinctrl_simple_set("/dev/pinctrl", dev)) 
        rtems_panic("%s: %s configure pins failed\n", __func__, 
            dev->name);
 
    spi->dma_tx = ofw_dma_chan_request(devp->np, "dma_tx", 
        specs, sizeof(specs));
    if (spi->dma_tx) 
        spi->dma_tx->config.dma_slot = specs[0];

    spi->dma_rx = ofw_dma_chan_request(devp->np, "dma_rx", 
        specs, sizeof(specs));
    if (spi->dma_rx) 
        spi->dma_rx->config.dma_slot = specs[0];

    return 0;
}

static struct drvmgr_drv_ops stm32h7_spi_driver = {
	.init = {
        stm32_spi_preprobe,
		stm32_spi_probe,
        stm32h7_spi_extprobe
	},
};

static const struct dev_id id_table[] = {
    {.compatible = "st,stm32h7-spi", (void *)&stm32h7_spi_cfg},
    {NULL, NULL}
};

OFW_PLATFORM_DRIVER(stm32_spi) = {
	.drv = {
		.drv_id   = DRIVER_SPI_ID,
		.name     = "spi",
		.bus_type = DRVMGR_BUS_TYPE_PLATFORM,
		.ops      = &stm32h7_spi_driver
	},
    .ids = id_table
};

//TODO: just only for debug
#include <unistd.h>
#include <fcntl.h>
#include "shell/shell_utils.h"

static int spi_writeread(const void *tx_buf, 
    size_t tx_len, void *rx_buf, size_t rx_len) {
    struct drvmgr_dev *master;
    spi_ioc_transfer msgs[] = {
        {
            .len = (uint16_t)tx_len,
            .tx_buf = tx_buf,
            .rx_buf = NULL,
            .cs_change = false,
            .cs = 0,
            .bits_per_word = 8,
            .mode = SPI_MODE_0,
            .speed_hz = 4000000,
            .delay_usecs = 0
        },{
            .len = (uint16_t)rx_len,
            .tx_buf = NULL,
            .rx_buf = rx_buf,
            .cs_change = true,
            .cs = 0,
            .bits_per_word = 8,
            .mode = SPI_MODE_0,
            .speed_hz = 4000000,
            .delay_usecs = 0
        }
    };
    master = drvmgr_dev_by_name("/dev/spi1");
    if (!master)
        return -ENODEV;

    return spi_master_transfer(master, msgs, 2);
}

static int shell_cmd_flashid(int argc, char **argv) {
    (void) argv;
    if (argc > 1)
        return -EINVAL;
    
    uint8_t cmd[] = {0x90, 0, 0, 0};
    uint32_t id = 0;

    if (spi_writeread(cmd, sizeof(cmd), &id, 2) > 0) 
        printf("<flash ID>: 0x%x\n", id);
    
    return 0;
}

static int shell_cmd_spiwrite(int argc, char **argv) {
    struct drvmgr_dev *master;
    char *tx_buf;
    size_t tx_len;

    if (argc < 2) 
        return -EINVAL;

    master = drvmgr_dev_by_name("/dev/spi1");
    if (!master)
        return -ENODEV;
    tx_buf = argv[1];
    tx_len = strlen(tx_buf);
    if (!tx_len) {
        npr_err(ulog, "(%s)Invalid length\n", tx_buf);
        return -EINVAL;
    }
    spi_ioc_transfer msgs[] = {
        {
            .len = (uint16_t)tx_len,
            .tx_buf = tx_buf,
            .rx_buf = NULL,
            .cs_change = true,
            .cs = 0,
            .bits_per_word = 8,
            .mode = SPI_MODE_0,
            .speed_hz = 100000,
            .delay_usecs = 0
        }
    };
    return spi_master_transfer(master, msgs, 1);
}

SHELL_CMDS_DEFINE(spidev_cmds,
	{
		.name = "spiwr",
		.usage = " SPI bus device test",
		.topic = "misc",
		.command = shell_cmd_spiwrite
	},
    {
		.name = "flashid",
		.usage = " Read flash id",
		.topic = "misc",
		.command = shell_cmd_flashid
    }
);
